# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/science'
tap 'buo/cask-upgrade'

# Binaries
brew 'bash' # Latest Bash version
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'python@3.8'
brew 'neovim'
brew 'grip'
brew 'markdown'
brew 'qpdf'
brew 'romkatv/powerlevel10k/powerlevel10k'

# Apps
cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'skype'
cask 'sublime-text'
cask 'mactex-no-gui'
cask 'google-chrome'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'dropbox'
cask 'franz'
cask 'skim'
cask 'mendeley-reference-manager'
cask 'r'
cask 'rstudio'
cask 'spotify'
cask 'stremio'
cask 'openinterminal'
cask 'iterm2'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Spark', id: 1176895641
mas '1Password', id: 1333542190
mas 'Magnet', id: 441258766
mas 'ToothFairy', id: 1191449274
mas 'Todoist', id: 585829637
mas 'Spark', id: 1176895641
mas 'Agenda', id: 1287445660
