# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/science'
tap 'buo/cask-upgrade'
tap 'koekeishiya/formulae'

# Binaries
brew 'bash' # Latest Bash version
brew 'zsh-syntax-highlighting'
brew 'tmux'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'neovim'
brew 'grip'
brew 'markdown'
brew 'qpdf'
brew 'romkatv/powerlevel10k/powerlevel10k'
brew 'fzf'
brew 'xcode-build-server'
brew 'swiftlint'
brew 'swiftformat'

# Apps
cask 'mactex-no-gui'
cask 'spotify'
cask 'dozer'
cask 'ghostty'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'ToothFairy', id: 1191449274
